In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)

1.0.3

In [3]:
seri = pd.Series([1, 20, 3, -12, 5], index=['a', 'b', 'c', 'd', 'e'])
seri

a     1
b    20
c     3
d   -12
e     5
dtype: int64

In [13]:
data = {
    'Name': ['XXX', 'YYY', 'ZZZ', 'QQQ'],
    'Exp': [1,3,5,4],
    'Salary': [1500,3000,6000,4200]
}

df = pd.DataFrame(data, columns=["Name", "Exp", "Salary"])
df
#print(data)

  Name  Exp  Salary
0  XXX    1    1500
1  YYY    3    3000
2  ZZZ    5    6000
3  QQQ    4    4200

In [28]:
# Definition of countries and capital
germany='germany'
countries = ['spain', 'france',germany , 'norway']
capitals = ['madrid', 'paris', 'berlin', 'oslo']

# Get index of 'germany': ind_ger
ind_ger=countries.index(germany)

# Use ind_ger to print out capital of Germany
print(capitals[ind_ger])

berlin

In [30]:
# Definition of countries and capital
countries = ['spain', 'france', 'germany', 'norway']
capitals = ['madrid', 'paris', 'berlin', 'oslo']

# From string in countries and capitals, create dictionary europe
europe = { 'spain':'madrid', 'france':'paris', 'germany':'berlin', 'norway':'oslo' }

# Print europe
print(europe)
print(europe.keys())
# Print out value that belongs to key 'norway'
print(europe['norway'])

{'spain': 'madrid', 'france': 'paris', 'germany': 'berlin', 'norway': 'oslo'}
dict_keys(['spain', 'france', 'germany', 'norway'])
oslo

In [42]:
#immutable objects
immutable_list={0:'hello',True:'dear',"two":"world"}
print(F"'One' exists in list: {'one' in immutable_list}")
print(F"'Two' exists in list: {'two' in immutable_list}")
del(immutable_list["two"])
print(F"'Two' exists in list: {'two' in immutable_list}")

'One' exists in list: False
'Two' exists in list: True
'Two' exists in list: False

In [43]:
#type error unhashable type: list
{["one","two","three"]:"value"}

TypeError: unhashable type: 'list'

In [ ]:
# dictionary: indexed by unique keys       : Collection of values order matters, select entire subsets
# list:     : indexed by range of numbers  : Lookup table with unique keys

In [44]:
# pandas    : high level data manipulation data, Dataframe, different columns with different types
dict={
    "country":["China","India","US","Indonesia","Pakistan"],
    "percent":["18.0","17.5","4.23","3.43","2.84"],
    "population":["1,394,015,977", "1,326,093,247","332,639,102","267,026,366","233,500,636"],
    "order":[1,2,3,4,5]
}

dict.index=["CH","EN","USA","IN","PA"]
dict
# big data import is better solution

AttributeError: 'dict' object has no attribute 'index'

In [45]:
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

my_dict={"country":names,
"drives_right":dr,
"cars_per_cap":cpc}

cars=pd.DataFrame(my_dict)
# Print cars
print(cars)

country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

In [47]:
trains = pd.read_csv('./titanic_dataset/train.csv', index_col=0)
print(trains)

Survived  Pclass  \
PassengerId
1                   0       3
2                   1       1
3                   1       3
4                   1       1
5                   0       3
...               ...     ...
887                 0       2
888                 1       1
889                 0       3
890                 1       1
891                 0       3

                                                          Name     Sex   Age  \
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
...                                                        ...     ...   ...
887                                      Montvila, Rev. Juozas    male  27.0
888                               Graham, Miss. Margaret Edith  female  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"  female   NaN
890                                      Behr, Mr. Karl Howell    male  26.0
891                                        Dooley, Mr. Patrick    male  32.0

             SibSp  Parch            Ticket     Fare Cabin Embarked
PassengerId
1                1      0         A/5 21171   7.2500   NaN        S
2                1      0          PC 17599  71.2833   C85        C
3                0      0  STON/O2. 3101282   7.9250   NaN        S
4                1      0            113803  53.1000  C123        S
5                0      0            373450   8.0500   NaN        S
...            ...    ...               ...      ...   ...      ...
887              0      0            211536  13.0000   NaN        S
888              0      0            112053  30.0000   B42        S
889              1      2        W./C. 6607  23.4500   NaN        S
890              0      0            111369  30.0000  C148        C
891              0      0            370376   7.7500   NaN        Q

[891 rows x 11 columns]

In [82]:
#Column-access
trains[["Ticket","Name"]] #.loc[[ x for x in range(850,890)]]
#row-access
trains[850:890] 
#loc label-based
#row-access
trains.loc[[ x for x in range(850,890)]]
#column -access
trains.loc[:,["Ticket","Name"]]
#Row & Column 
trains.loc[[x for x in range(850,860)],["Ticket","Name"]]
# Row&column iloc -> integer position-based
trains.iloc[:,[7,2]]
# single bracket version gives a Pandas Series, the double bracket version gives a Pandas DataFrame.

,Ticket,Name
PassengerId,,
1,A/5 21171,"Braund, Mr. Owen Harris"
2,PC 17599,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,STON/O2. 3101282,"Heikkinen, Miss. Laina"
4,113803,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,373450,"Allen, Mr. William Henry"
...,...,...
887,211536,"Montvila, Rev. Juozas"
888,112053,"Graham, Miss. Margaret Edith"
889,W./C. 6607,"Johnston, Miss. Catherine Helen ""Carrie"""
890,111369,"Behr, Mr. Karl Howell"
891,370376,"Dooley, Mr. Patrick"

In [83]:
df=trains
df.shape

(891, 11)

In [84]:
df.size

9801

In [85]:
df.ndim # number of dimension

2

In [86]:
df.corr()

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
Age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [89]:
df.dropna() #bu direkt NaN bulunan İndex'i düşürür
df.dropna(axis=1)

,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
PassengerId,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500
...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000
888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500
890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000
891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500

In [95]:
print(df.columns)
df.dtypes

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [91]:
df.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [93]:
df.tail(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [109]:
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [96]:
df.count() # not Nan data count

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

In [107]:
df.loc[:, 'Age']

PassengerId
1      22.0
2      38.0
3      26.0
4      35.0
5      35.0
       ...
887    27.0
888    19.0
889     NaN
890    26.0
891    32.0
Name: Age, Length: 891, dtype: float64

In [141]:
df = pd.read_csv('./titanic_dataset/train.csv')
df.drop('Cabin', axis=1)
df.Cabin[0] is None

False

In [142]:
#df.iloc[0:895:3, 3:3:1] = '_3_6_2'
df['Age'].max()
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [133]:
df.dropna(subset=["Cabin", "Fare", "Parch"], axis=0, thresh=3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
3,4,1,1,_3_6_2,_3_6_2,_3_6_2,1,0,113803,53.1000,C123,S
6,7,0,1,_3_6_2,_3_6_2,_3_6_2,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,_3_6_2,_3_6_2,_3_6_2,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C

In [134]:
df['Survived'].sum()

342

In [180]:
df = pd.read_csv('./titanic_dataset/train.csv')
df['Age'].max()

80.0

In [174]:
print(df['Age'].idxmax()) #Return index of first occurrence of maximum over requested axis.

print(df['Age'].idxmin())

630
803

In [175]:
df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [176]:
df.median()

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [184]:
a = pd.Series([10, 20, 30, 35, 40, 50, 60])
a.describe() # summary
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [183]:
df.Age.apply(lambda x: x if x >= 1 else 0)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [201]:
df.Survived.unique()
df.Survived.apply(lambda ccc: ccc.replace("Q", "Z"))

AttributeError: 'int' object has no attribute 'replace'

In [197]:
df[np.logical_xor(1, df['Age'] >=0)] # find age equals to NaN
print(df.head(1))
df.tail(1)

PassengerId  Survived  Pclass                     Name   Sex   Age  SibSp  \
0            1         0       3  Braund, Mr. Owen Harris  male  22.0      1

   Parch     Ticket  Fare Cabin Embarked
0      0  A/5 21171  7.25   NaN        S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [198]:
grup = df.groupby('Embarked')
grup.sum()

          PassengerId  Survived  Pclass       Age  SibSp  Parch        Fare
Embarked
C               74820        93     317   4005.92     65     61  10072.2962
Q               32178        30     224    786.50     33     13   1022.2543
S              289496       217    1514  16312.75    368    266  17439.3988

In [202]:

for isim, içerik in grup:
    print("=>", isim)
    print(içerik.Age)
    print("-"*40)

grup.Age.agg(np.mean)
# grup.mean().Age
grup.agg([np.size, np.sum, np.mean])

=> C
1      38.0
9      14.0
19      NaN
26      NaN
30     40.0
       ...
866    27.0
874    28.0
875    15.0
879    56.0
889    26.0
Name: Age, Length: 168, dtype: float64
----------------------------------------
=> Q
5       NaN
16      2.0
22     15.0
28      NaN
32      NaN
       ...
790     NaN
825     NaN
828     NaN
885    39.0
890    32.0
Name: Age, Length: 77, dtype: float64
----------------------------------------
=> S
0      22.0
2      26.0
3      35.0
4      35.0
6      54.0
       ...
883    28.0
884    25.0
886    27.0
887    19.0
888     NaN
Name: Age, Length: 644, dtype: float64
----------------------------------------

         PassengerId                     Survived                Pclass        \
                size     sum        mean     size  sum      mean   size   sum
Embarked
C                168   74820  445.357143      168   93  0.553571    168   317
Q                 77   32178  417.896104       77   30  0.389610     77   224
S                644  289496  449.527950      644  217  0.336957    644  1514

                      Age  ...            SibSp                Parch       \
              mean   size  ...       mean  size  sum      mean  size  sum
Embarked                   ...
C         1.886905  168.0  ...  30.814769   168   65  0.386905   168   61
Q         2.909091   77.0  ...  28.089286    77   33  0.428571    77   13
S         2.350932  644.0  ...  29.445397   644  368  0.571429   644  266

                     Fare
              mean   size         sum       mean
Embarked
C         0.363095  168.0  10072.2962  59.954144
Q         0.168831   77.0   1022.2543  13.276030
S         0.413043  644.0  17439.3988  27.079812

[3 rows x 21 columns]

In [203]:
grup.get_group('S').shape

(644, 11)

In [204]:
grup.filter(lambda x: x['Fare'].mean() > 30)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN
...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148